# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'cocoapods'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'koekeishiya/formulae/skhd'
brew 'koekeishiya/formulae/yabai'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'nvim'
brew 'postgres'
brew 'prettier'
brew 'ripgrep'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'vim'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'python3'
brew 'node'
brew 'yarn'
brew 'fastlane'

# Apps
cask 'android-studio'
cask 'dashlane'
cask 'discord'
cask 'docker'
cask 'dbeaver-community'
cask 'figma'
cask 'github'
cask 'google-backup-and-sync'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'notion'
cask 'numi'
cask 'obs'
cask 'ringcentral'
cask 'slack'
cask 'spotify'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'App Uninstaller - Clean Leftover Application Files', id: 1199973273
mas 'Be Focused Pro - Focus Timer', id: 961632517
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'MuteMyMic', id: 456362093
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'UTC Bar', id: 525372278
mas 'Xcode', id: 497799835
